// -------------------------------------------------------------------
abstract class Mammal {
    constructor(
        protected name: string,
        protected residence: string,
    ) {
        this.name = name;
        this.residence = residence;
    }

    // 일반 메소드
    public breath(): void {
        console.log(`${this.name}이/가 폐호흡합니다.`)
    }

    // 추상 메소드 : 자식쪽에서 반드시 오버라이딩해야하는 메소드
    abstract printResidence(): void;
}

// 추상 클래스는 단독으로 인스턴스 생성이 불가능
// const mammal: Mammal = new Mammal();  // error

// 부모의 추상메소드를 반드시 오버라이드해서 구현해야 오류가 나지 않음
class Whale extends Mammal {
    // 추상 메소드 오버라이드 하지 않으면 에러 발생
    override printResidence(): void {
        
    }
}

// -------------------------------------------------------------------
// -------------------------------------------------------------------
// -------------------------------------------------------------------
// -------------------------------------------------------------------
// -------------------------------------------------------------------
// -------------------------------------------------------------------
// -------------------------------------------------------------------
// -------------------------------------------------------------------
